//問題
const question = [
    {
        q: "野菜",
        a: ["は", "く", "さ", "い"]
    },
    {
        q: "虫",
        a: ["こ", "お", "ろ", "ぎ"]
    },
    {
        q: "動物",
        a: ["ラ", "イ", "オ", "ン"]
    },
    {
        q: "文房具",
        a: ["え", "ん", "ぴ", "つ"]
    },
    {
        q: "国",
        a: ["ア", "メ", "リ", "カ"]
    },
    {
        q: "野菜",
        a: ["だ", "い", "こ", "ん"]
    },
    {
        q: "虫",
        a: ["み", "つ", "ば", "ち"]
    },
    {
        q: "動物",
        a: ["シ", "マ", "ウ", "マ"]
    },
    {
        q: "文房具",
        a: ["け", "し", "ご", "む"]
    },
    {
        q: "国",
        a: ["イ", "ギ", "リ", "ス"]
    },
        {
        q: "野菜",
        a: ["に", "ん", "じ", "ん"]
    },
    {
        q: "虫",
        a: ["か", "ま", "き", "り"]
    },
    {
        q: "動物",
        a: ["ア", "ザ", "ラ", "シ"]
    },
    {
        q: "文房具",
        a: ["そ", "ろ", "ば", "ん"]
    },
    {
        q: "国",
        a: ["メ", "キ", "シ", "コ"]
    },
    {
        q: "野菜",
        a: ["し", "い", "た", "け"]
    },
    {
        q: "虫",
        a: ["ク", "ワ", "ガ", "タ"]
    },
    {
        q: "動物",
        a: ["い", "の", "し", "し"]
    },
    {
        q: "文房具",
        a: ["ふ", "う", "と", "う"]
    },
    {
        q: "国",
        a: ["オ", "ラ", "ン", "ダ"]
    },
        {
        q: "野菜",
        a: ["え", "だ", "ま", "め"]
    },
    {
        q: "遊び",
        a: ["あ", "や", "と", "り"]
    },
    {
        q: "動物",
        a: ["オ", "オ", "カ", "ミ"]
    },
    {
        q: "節分で豆をぶつける",
        a: ["あ", "か", "お", "に"]
    },
    {
        q: "国",
        a: ["フ", "ラ", "ン", "ス"]
    },
    {
        q: "野菜",
        a: ["た", "ま", "ね", "ぎ"]
    },
    {
        q: "遊び",
        a: ["け", "ん", "だ", "ま"]
    },
    {
        q: "動物",
        a: ["ト", "ナ", "カ", "イ"]
    },
    {
        q: "酸っぱい",
        a: ["う", "め", "ぼ", "し"]
    },
    {
        q: "国",
        a: ["ブ", "ラ", "ジ", "ル"]
    },
        {
        q: "野菜",
        a: ["に", "ん", "に", "く"]
    },
    {
        q: "遊び",
        a: ["お", "て", "だ", "ま"]
    },
    {
        q: "動物",
        a: ["ニ", "ワ", "ト", "リ"]
    },
    {
        q: "法で裁く",
        a: ["さ", "い", "ば", "ん"]
    },
    {
        q: "国",
        a: ["イ", "タ", "リ", "ア"]
    },
    {
        q: "野菜",
        a: ["れ", "ん", "こ", "ん"]
    },
    {
        q: "遊び",
        a: ["お", "は", "じ", "き"]
    },
    {
        q: "動物",
        a: ["カ", "モ", "シ", "カ"]
    },
    {
        q: "赤い景色",
        a: ["ゆ", "う", "や", "け"]
    },
    {
        q: "国",
        a: ["エ", "ジ", "プ", "ト"]
    },
        {
        q: "身体を動かす",
        a: ["た", "い", "そ", "う"]
    },
    {
        q: "遊び",
        a: ["た", "け", "う", "ま"]
    },
    {
        q: "動物",
        a: ["ペ", "ン", "ギ", "ン"]
    },
    {
        q: "捨てる所",
        a: ["ご", "み", "ば", "こ"]
    },
    {
        q: "国",
        a: ["ス", "ペ", "イ", "ン"]
    },
    {
        q: "泳ぐ",
        a: ["す", "い", "え", "い"]
    },
    {
        q: "言葉遊び",
        a: ["し", "り", "と", "り"]
    },
    {
        q: "刀を持っている",
        a: ["さ", "む", "ら", "い"]
    },
    {
        q: "家具",
        a: ["ざ", "ぶ", "と", "ん"]
    },
    {
        q: "国",
        a: ["ベ", "ト", "ナ", "ム"]
    },
    {
        q: "県",
        a: ["あ", "お", "も", "り"]
    },
    {
        q: "県",
        a: ["ふ", "く", "し", "ま"]
    },
    {
        q: "県",
        a: ["さ", "い", "た", "ま"]
    },
    {
        q: "県",
        a: ["か", "な", "が", "わ"]
    },
    {
        q: "県",
        a: ["い", "し", "か", "わ"]
    },
    {
        q: "県",
        a: ["ひ", "ろ", "し", "ま"]
    },
    {
        q: "県",
        a: ["と", "く", "し", "ま"]
    },
    {
        q: "県",
        a: ["ふ", "く", "お", "か"]
    },
    {
        q: "県",
        a: ["み", "や", "ざ", "き"]
    },
    {
        q: "県",
        a: ["お", "き", "な", "わ"]
    },
        {
        q: "家をきれいにする",
        a: ["そ", "う", "じ", "き"]
    },
    {
        q: "床を拭く",
        a: ["ぞ", "う", "き", "ん"]
    },
    {
        q: "手や汗を拭く",
        a: ["ハ", "ン", "カ", "チ"]
    },
    {
        q: "食後に使う",
        a: ["ハ", "ブ", "ラ", "シ"]
    },
    {
        q: "身体",
        a: ["く", "ち", "び", "る"]
    },
    {
        q: "身体",
        a: ["て", "の", "ひ", "ら"]
    },
    {
        q: "身体",
        a: ["つ", "ま", "さ", "き"]
    },
    {
        q: "身体",
        a: ["お", "や", "ゆ", "び"]
    },
    {
        q: "乗り物",
        a: ["ひ", "こ", "う", "き"]
    },
    {
        q: "乗り物",
        a: ["ち", "か", "て", "つ"]
    },
        {
        q: "乗り物",
        a: ["ク", "ラ", "ウ", "ン"]
    },
    {
        q: "乗り物",
        a: ["タ", "ク", "シ", "ー"]
    },
    {
        q: "身に着けるもの",
        a: ["エ", "プ", "ロ", "ン"]
    },
    {
        q: "飲む時に使う",
        a: ["ス", "ト", "ロ", "ー"]
    },
    {
        q: "身に着けるもの",
        a: ["よ", "う", "ふ", "く"]
    },
    {
        q: "身に着けるもの",
        a: ["て", "ぶ", "く", "ろ"]
    },
    {
        q: "身に着けるもの",
        a: ["な", "が", "ぐ", "つ"]
    },
    {
        q: "身に着けるもの",
        a: ["ネ", "ク", "タ", "イ"]
    },
    {
        q: "身に着けるもの",
        a: ["も", "も", "ひ", "き"]
    },
    {
        q: "旅行で行きたい",
        a: ["お", "ん", "せ", "ん"]
    },
    {
        q: "１から６まで",
        a: ["サ", "イ", "コ", "ロ"]
    },
    {
        q: "二重に跳べたらすごい",
        a: ["な", "わ", "と", "び"]
    },
    {
        q: "大事なもの",
        a: ["へ", "そ", "く", "り"]
    },
    {
        q: "大事な人",
        a: ["こ", "い", "び", "と"]
    },
    {
        q: "大事なこと",
        a: ["あ", "い", "さ", "つ"]
    },
    {
        q: "身体を動かす教科",
        a: ["た", "い", "い", "く"]
    },
    {
        q: "植物を使った伝統文化",
        a: ["ぼ", "ん", "さ", "い"]
    },
    {
        q: "植物を使った伝統文化",
        a: ["い", "け", "ば", "な"]
    },
    {
        q: "車の燃料",
        a: ["ガ", "ソ", "リ", "ン"]
    },
    {
        q: "３６度台が平熱",
        a: ["た", "い", "お", "ん"]
    },
        {
        q: "空に浮かんでいる",
        a: ["た", "い", "よ", "う"]
    },
    {
        q: "手をふく",
        a: ["お", "し", "ぼ", "り"]
    },
    {
        q: "朝と夕に届く",
        a: ["し", "ん", "ぶ", "ん"]
    },
    {
        q: "遊具",
        a: ["ブ", "ラ", "ン", "コ"]
    },
    {
        q: "強い熱帯低気圧",
        a: ["た", "い", "ふ", "う"]
    },
    {
        q: "盗っ人",
        a: ["ど", "ろ", "ぼ", "う"]
    },
    {
        q: "とても怖い",
        a: ["ゆ", "う", "れ", "い"]
    },
    {
        q: "おへそをとられる",
        a: ["カ", "ミ", "ナ", "リ"]
    },
    {
        q: "とても怖い",
        a: ["ウ", "イ", "ル", "ス"]
    },
    {
        q: "タイルが有名",
        a: ["か", "さ", "は", "ら"]
    },
　　{
        q: "踏むと進む",
        a: ["ア", "ク", "セ", "ル"]
    },
    {
        q: "花",
        a: ["あ", "じ", "さ", "い"]
    },
    {
        q: "野菜",
        a: ["ア", "ス", "パ", "ラ"]
    },
    {
        q: "交通〇〇",
        a: ["あ", "ん", "ぜ", "ん"]
    },
    {
        q: "〇〇〇〇を叩いて渡る",
        a: ["い", "し", "ば", "し"]
    },
    {
        q: "胃が痛い時に飲む",
        a: ["い", "ぐ", "す", "り"]
    },
    {
        q: "子供が大好き",
        a: ["い", "た", "ず", "ら"]
    },
    {
        q: "ナンバーワン！",
        a: ["い", "ち", "ば", "ん"]
    },
    {
        q: "犬の泳ぎ方",
        a: ["い", "ぬ", "か", "き"]
    },
    {
        q: "農作業",
        a: ["い", "ね", "か", "り"]
    },
    {
        q: "先生に怒られる",
        a: ["い", "ね", "む", "り"]
    },
    {
        q: "食べ物を消化する",
        a: ["い", "ぶ", "く", "ろ"]
    },
    {
        q: "弟の反対",
        a: ["い", "も", "う", "と"]
    },
    {
        q: "食べ過ぎたら",
        a: ["い", "も", "た", "れ"]
    },
    {
        q: "絵",
        a: ["イ", "ラ", "ス", "ト"]
    },
    {
        q: "出口の反対",
        a: ["い", "り", "ぐ", "ち"]
    },
    {
        q: "水戸黄門でおなじみ",
        a: ["い", "ん", "ろ", "う"]
    },
    {
        q: "片目をつぶる",
        a: ["ウ", "イ", "ン", "ク"]
    },
    {
        q: "予言",
        a: ["う", "ら", "な", "い"]
    },
    {
        q: "電化製品",
        a: ["エ", "ア", "コ", "ン"]
    },
        {
        q: "金色に輝く",
        a: ["お", "う", "ご", "ん"]
    },
    {
        q: "王冠をかぶっている",
        a: ["お", "う", "さ", "ま"]
    },
    {
        q: "子供の買い物",
        a: ["お", "つ", "か", "い"]
    },
    {
        q: "妹の反対",
        a: ["お", "と", "う", "と"]
    },
    {
        q: "ワイワイ楽しい",
        a: ["お", "ま", "つ", "り"]
    },
    {
        q: "神社で頂く",
        a: ["お", "ま", "も", "り"]
    },
    {
        q: "神社で引く",
        a: ["お", "み", "く", "じ"]
    },
    {
        q: "紙を折って形を作る",
        a: ["お", "り", "が", "み"]
    },
    {
        q: "歌や楽器",
        a: ["お", "ん", "が", "く"]
    },
    {
        q: "煙が出る",
        a: ["え", "ん", "と", "つ"]
    },
    {
        q: "相撲で２番目に強い",
        a: ["お", "お", "ぜ", "き"]
    },
    {
        q: "とても怖い",
        a: ["か", "い", "ぞ", "く"]
    },
    {
        q: "海の外",
        a: ["か", "い", "が", "い"]
    },
    {
        q: "新年の行事",
        a: ["か", "き", "ぞ", "め"]
    },
　　{
        q: "釘を打つ",
        a: ["か", "な", "づ", "ち"]
    },
    {
        q: "虫",
        a: ["カ", "ナ", "ブ", "ン"]
    },
    {
        q: "鬼が持っている",
        a: ["か", "な", "ぼ", "う"]
    },
    {
        q: "非常食になる",
        a: ["か", "ん", "づ", "め"]
    },
    {
        q: "選手に指導する人",
        a: ["か", "ん", "と", "く"]
    },
    {
        q: "絵を描く紙",
        a: ["が", "よ", "う", "し"]
    },
    {
        q: "勉強ばかりしている",
        a: ["が", "り", "べ", "ん"]
    },
    {
        q: "１月１日",
        a: ["が", "ん", "た", "ん"]
    },
    {
        q: "戦うロボット",
        a: ["ガ", "ン", "ダ", "ム"]
    },
    {
        q: "顔の正面",
        a: ["が", "ん", "め", "ん"]
    },
    {
        q: "ゲゲゲの",
        a: ["き", "た", "ろ", "う"]
    },
    {
        q: "預金や融資",
        a: ["ぎ", "ん", "こ", "う"]
    },
    {
        q: "飛行機がいっぱい",
        a: ["く", "う", "こ", "う"]
    },
    {
        q: "抽選",
        a: ["く", "じ", "び", "き"]
    },
    {
        q: "織姫と彦星",
        a: ["た", "な", "ば", "た"]
    },
    {
        q: "赤い香辛料",
        a: ["タ", "バ", "ス", "コ"]
    },
    {
        q: "社会の安全を守る",
        a: ["け", "い", "さ", "つ"]
    },
        {
        q: "持ち運びできる電話",
        a: ["け", "い", "た", "い"]
    },
    {
        q: "カエルの鳴き声",
        a: ["ケ", "ロ", "ケ", "ロ"]
    },
    {
        q: "鉄棒で身体を引き上げる",
        a: ["け", "ん", "す", "い"]
    },
    {
        q: "靴をしまう",
        a: ["げ", "た", "ば", "こ"]
    },
    {
        q: "栄養のある米",
        a: ["げ", "ん", "ま", "い"]
    },
    {
        q: "遊具がある",
        a: ["こ", "う", "え", "ん"]
    },
    {
        q: "暗い所が好き",
        a: ["コ", "ウ", "モ", "リ"]
    },
    {
        q: "チョークで書く",
        a: ["こ", "く", "ば", "ん"]
    },
    {
        q: "野菜",
        a: ["こ", "ま", "つ", "な"]
    },
    {
        q: "２４時間営業",
        a: ["コ", "ン", "ビ", "ニ"]
    },
    {
        q: "名無しの",
        a: ["ご", "ん", "べ", "え"]
    },
    {
        q: "運動会の種目",
        a: ["た", "ま", "い", "れ"]
    },
    {
        q: "頭をぶつけたらできる",
        a: ["た", "ん", "こ", "ぶ"]
    },
    {
        q: "文章を作る",
        a: ["さ", "く", "ぶ", "ん"]
    },
    {
        q: "イモの一種",
        a: ["さ", "と", "い", "も"]
    },
    {
        q: "チクチクしている",
        a: ["サ", "ボ", "テ", "ン"]
    },
    {
        q: "小学校で習う",
        a: ["さ", "ん", "す", "う"]
    },
    {
        q: "頭をかんでもらう",
        a: ["し", "し", "ま", "い"]
    },
    {
        q: "県",
        a: ["し", "ず", "お", "か"]
    },
    {
        q: "下に敷く",
        a: ["し", "た", "じ", "き"]
    },
    {
        q: "願い事を書く紙",
        a: ["た", "ん", "ざ", "く"]
    },
    {
        q: "尻から落ちる",
        a: ["し", "り", "も", "ち"]
    },
    {
        q: "青　黄色　赤",
        a: ["し", "ん", "ご", "う"]
    },
    {
        q: "スポーツで判定する人",
        a: ["し", "ん", "ぱ", "ん"]
    },
    {
        q: "ボードゲーム",
        a: ["す", "ご", "ろ", "く"]
    },
    {
        q: "はんこ",
        a: ["ス", "タ", "ン", "プ"]
    },
    {
        q: "霧を噴射",
        a: ["ス", "プ", "レ", "ー"]
    },
    {
        q: "背中で泳ぐ",
        a: ["せ", "お", "よ", "ぎ"]
    },
    {
        q: "一人ひとり個性がある",
        a: ["せ", "い", "か", "く"]
    },
    {
        q: "化石燃料",
        a: ["せ", "き", "た", "ん"]
    },
    {
        q: "むだを省いて切り詰める",
        a: ["せ", "つ", "や", "く"]
    },
    {
        q: "魚を釣る針",
        a: ["つ", "り", "ば", "り"]
    },
    {
        q: "速く届く郵便",
        a: ["そ", "く", "た", "つ"]
    },
    {
        q: "天性の才能",
        a: ["て", "ん", "さ", "い"]
    },
    {
        q: "ハサミを持っている",
        a: ["ザ", "リ", "ガ", "ニ"]
    },
    {
        q: "海外旅行で起こる症状",
        a: ["じ", "さ", "ぼ", "け"]
    },
    {
        q: "もがいている様子",
        a: ["ジ", "タ", "バ", "タ"]
    },
    {
        q: "とても大事なハンコ",
        a: ["じ", "つ", "い", "ん"]
    },
    {
        q: "２４時間飲み物が買える",
        a: ["じ", "は", "ん", "き"]
    },
    {
        q: "国に払う",
        a: ["ぜ", "い", "き", "ん"]
    },
    {
        q: "東京の大学",
        a: ["と", "う", "だ", "い"]
    },
    {
        q: "飛ぶ魚",
        a: ["ト", "ビ", "ウ", "オ"]
    },
    {
        q: "カードゲームで使う",
        a: ["ト", "ラ", "ン", "プ"]
    },
    {
        q: "いいかげんなこと",
        a: ["で", "た", "ら", "め"]
    },
    {
        q: "計算機",
        a: ["で", "ん", "た", "く"]
    },
    {
        q: "犬や猫や馬など",
        a: ["ど", "う", "ぶ", "つ"]
    },
    {
        q: "相撲のかけ声",
        a: ["ど", "す", "こ", "い"]
    },
    {
        q: "泥だらけ",
        a: ["ど", "ろ", "ん", "こ"]
    },
    {
        q: "お池にはまってさあ大変",
        a: ["ど", "ん", "ぐ", "り"]
    },
    {
        q: "くぐり抜ける",
        a: ["ト", "ン", "ネ", "ル"]
    },
    {
        q: "結婚の仲立ちを行う",
        a: ["な", "こ", "う", "ど"]
    },
    {
        q: "イモの一種",
        a: ["な", "が", "い", "も"]
    },
    {
        q: "花",
        a: ["な", "の", "は", "な"]
    },
    {
        q: "県",
        a: ["に", "い", "が", "た"]
    },
    {
        q: "人物画",
        a: ["に", "が", "お", "え"]
    },
    {
        q: "私達が話す言葉",
        a: ["に", "ほ", "ん", "ご"]
    },
    {
        q: "美男子",
        a: ["に", "ま", "い", "め"]
    },
    {
        q: "私達自身",
        a: ["に", "ん", "げ", "ん"]
    },
    {
        q: "睡眠が足りない",
        a: ["ね", "ぶ", "そ", "く"]
    },
    {
        q: "農作物の薬",
        a: ["の", "う", "や", "く"]
    },
    {
        q: "飼い主がない犬",
        a: ["の", "ら", "い", "ぬ"]
    },
    {
        q: "飼い主がない猫",
        a: ["の", "ら", "ね", "こ"]
    },
    {
        q: "灰の色",
        a: ["は", "い", "い", "ろ"]
    },
    {
        q: "赤ちゃんの動き",
        a: ["ハ", "イ", "ハ", "イ"]
    },
    {
        q: "甘酸っぱい",
        a: ["は", "つ", "こ", "い"]
    },
    {
        q: "正月にみる夢",
        a: ["は", "つ", "ゆ", "め"]
    },
    {
        q: "花についている",
        a: ["は", "な", "び", "ら"]
    },
    {
        q: "ゲーム",
        a: ["は", "な", "ふ", "だ"]
    },
    {
        q: "幸せいっぱい",
        a: ["は", "な", "よ", "め"]
    },
    {
        q: "何か食べたい",
        a: ["は", "ら", "ぺ", "こ"]
    },
    {
        q: "細長い",
        a: ["は", "り", "が", "ね"]
    },
    {
        q: "ジョリジョリと剃る",
        a: ["ひ", "げ", "そ", "り"]
    },
    {
        q: "花",
        a: ["ひ", "ま", "わ", "り"]
    },
    {
        q: "あいうえお　かきくけこ",
        a: ["ひ", "ら", "が", "な"]
    },
    {
        q: "日本一高い山",
        a: ["ふ", "じ", "さ", "ん"]
    },
    {
        q: "運転に注意",
        a: ["ふ", "み", "き", "り"]
    },
    {
        q: "故郷",
        a: ["ふ", "る", "さ", "と"]
    },
    {
        q: "包む",
        a: ["ふ", "ろ", "し", "き"]
    },
    {
        q: "水がふきだす",
        a: ["ふ", "ん", "す", "い"]
    },
    {
        q: "昭和の次",
        a: ["へ", "い", "せ", "い"]
    },
    {
        q: "硬くて高価で美しい",
        a: ["ほ", "う", "せ", "き"]
    },
    {
        q: "ちょこっと酔う",
        a: ["ほ", "ろ", "よ", "い"]
    },
    {
        q: "白を英語で",
        a: ["ホ", "ワ", "イ", "ト"]
    },
    {
        q: "コンピュータ",
        a: ["パ", "ソ", "コ", "ン"]
    },
    {
        q: "警察官が乗る",
        a: ["パ", "ト", "カ", "ー"]
    },
    {
        q: "鼻が長い",
        a: ["ピ", "ノ", "キ", "オ"]
    },
    {
        q: "宣伝用の張り紙",
        a: ["ポ", "ス", "タ", "ー"]
    },
    {
        q: "両手を上げる",
        a: ["ば", "ん", "ざ", "い"]
    },
    {
        q: "手紙を書く用紙",
        a: ["び", "ん", "せ", "ん"]
    },
    {
        q: "お金が無い",
        a: ["び", "ん", "ぼ", "う"]
    },
    {
        q: "手紙をやりとり",
        a: ["ぶ", "ん", "つ", "う"]
    },
    {
        q: "国",
        a: ["ベ", "ル", "ギ", "ー"]
    },
    {
        q: "牛若丸と戦った",
        a: ["べ", "ん", "け", "い"]
    },
    {
        q: "箱に食事を入れる",
        a: ["べ", "ん", "と", "う"]
    },
    {
        q: "現実になった夢",
        a: ["ま", "さ", "ゆ", "め"]
    },
    {
        q: "猫が大好き",
        a: ["マ", "タ", "タ", "ビ"]
    },
    {
        q: "香りがよい",
        a: ["マ", "ツ", "タ", "ケ"]
    },
    {
        q: "まんまるの月",
        a: ["ま", "ん", "げ", "つ"]
    },
    {
        q: "日本料理の定番",
        a: ["み", "そ", "し", "る"]
    },
    {
        q: "髪型",
        a: ["み", "つ", "あ", "み"]
    },
    {
        q: "色",
        a: ["む", "ら", "さ", "き"]
    },
    {
        q: "大きな音で目を覚ます",
        a: ["め", "ざ", "ま", "し"]
    },
    {
        q: "ガス漏れしたら大変",
        a: ["も", "と", "せ", "ん"]
    },
    {
        q: "収納する場所",
        a: ["も", "の", "お", "き"]
    },
    {
        q: "中身の無い缶",
        a: ["あ", "き", "か", "ん"]
    },
    {
        q: "県",
        a: ["い", "ば", "ら", "き"]
    },
    {
        q: "野菜",
        a: ["い", "ん", "げ", "ん"]
    },
    {
        q: "偉い政治家",
        a: ["だ", "い", "じ", "ん"]
    },
    {
        q: "仏様の像",
        a: ["ぶ", "つ", "ぞ", "う"]
    },
    {
        q: "グローブで殴る",
        a: ["ボ", "ク", "サ", "ー"]
    },
    {
        q: "屋久杉が有名",
        a: ["や", "く", "し", "ま"]
    },
    {
        q: "ゆびきりげんまん",
        a: ["や", "く", "そ", "く"]
    },
    {
        q: "見物人",
        a: ["や", "じ", "う", "ま"]
    },
    {
        q: "巻貝を背負っている",
        a: ["ヤ", "ド", "カ", "リ"]
    },
        {
        q: "馬の上から矢を射る",
        a: ["や", "ぶ", "さ", "め"]
    },
    {
        q: "県",
        a: ["や", "ま", "が", "た"]
    },
    {
        q: "県",
        a: ["や", "ま", "な", "し"]
    },
    {
        q: "県",
        a: ["や", "ま", "ぐ", "ち"]
    },
    {
        q: "夕方に降る雨",
        a: ["ゆ", "う", "だ", "ち"]
    },
    {
        q: "ポストに投函",
        a: ["ゆ", "う", "び", "ん"]
    },
    {
        q: "体を温める",
        a: ["ゆ", "た", "ん", "ぽ"]
    },
    {
        q: "力士の最高位",
        a: ["よ", "こ", "づ", "な"]
    },
    {
        q: "神奈川県の市",
        a: ["よ", "こ", "は", "ま"]
    },
    {
        q: "夜見る桜",
        a: ["よ", "ざ", "く", "ら"]
    },
    {
        q: "ついでに立ち寄る",
        a: ["よ", "り", "み", "ち"]
    },
    {
        q: "いたずら書き",
        a: ["ら", "く", "が", "き"]
    },
    {
        q: "無線で動かす",
        a: ["ラ", "ジ", "コ", "ン"]
    },
    {
        q: "走る人",
        a: ["ラ", "ン", "ナ", "ー"]
    },
    {
        q: "少しずつ続けたい",
        a: ["リ", "ハ", "ビ", "リ"]
    },
    {
        q: "テレビを操作",
        a: ["リ", "モ", "コ", "ン"]
    },
    {
        q: "留守を守る",
        a: ["る", "す", "ば", "ん"]
    },
    {
        q: "音を記録",
        a: ["ろ", "く", "お", "ん"]
    },
    {
        q: "県",
        a: ["わ", "か", "や", "ま"]
    },
    {
        q: "割って使う",
        a: ["わ", "り", "ば", "し"]
    },
    {
        q: "選挙で負けたらただの人",
        a: ["せ", "い", "じ", "か"]
    },
    {
        q: "電波を送受信",
        a: ["ア", "ン", "テ", "ナ"]
    },
    {
        q: "水がでる",
        a: ["す", "い", "ど", "う"]
    },
    {
        q: "野菜",
        a: ["パ", "プ", "リ", "カ"]
    },
    {
        q: "昇り降りする",
        a: ["か", "い", "だ", "ん"]
    },
    {
        q: "フルーツ",
        a: ["く", "だ", "も", "の"]
    },
    {
        q: "胸の中にある",
        a: ["し", "ん", "ぞ", "う"]
    },
    {
        q: "服の汚れを落とす",
        a: ["せ", "ん", "ざ", "い"]
    },
    {
        q: "服を洗う",
        a: ["せ", "ん", "た", "く"]
    },
    {
        q: "服のシワを伸ばす",
        a: ["ア", "イ", "ロ", "ン"]
    },
    {
        q: "頭に巻く",
        a: ["は", "ち", "ま", "き"]
    },
    {
        q: "運動会の種目",
        a: ["つ", "な", "ひ", "き"]
    },
    {
        q: "正月に羽根を羽子板でつく",
        a: ["は", "ね", "つ", "き"]
    },
    {
        q: "友人",
        a: ["と", "も", "だ", "ち"]
    },
    {
        q: "両手を上げて喜ぶ",
        a: ["バ", "ン", "ザ", "イ"]
    },
    {
        q: "お笑い",
        a: ["ま", "ん", "ざ", "い"]
    },
    {
        q: "仕事をクビになる",
        a: ["リ", "ス", "ト", "ラ"]
    },
    {
        q: "釘を叩く",
        a: ["ハ", "ン", "マ", "ー"]
    },
    {
        q: "かっこいい",
        a: ["ハ", "ン", "サ", "ム"]
    },
    {
        q: "掃除用具",
        a: ["ち", "り", "と", "り"]
    },
];

//top画面
const scenetop = document.querySelector("#start");
//game画面
const scecegame = document.querySelector("#game");
//正解不正解表示画面
const next = document.querySelector("#next");
const field = document.querySelector("#field");
const select = document.querySelectorAll(".select");
const answer = document.querySelectorAll(".answer");

//選択された答えを順番に格納
let answers = [];
//問題番号を管理
let questionnum = 0;


init();
function init() {
    changescene(scecegame, scenetop);
    scenetop.addEventListener('click', gamestart, false);
}

function changescene(hiddenscene, visiblescene) {
    hiddenscene.classList.add("is-hidden");
    hiddenscene.classList.remove("is-visible");
    visiblescene.classList.add("is-visible");
}

function gamestart() {
    changescene(scenetop, scecegame);
    showQuestion()
}

// 【JavaScript】配列の要素をランダムに表示する(ブックマーク)を応用して追加
function shuffle(array) {
    for(let i = (question.length - 1); i > 0; i--) {
        const j = Math.floor(Math.random() * (i - 1));
        [array[i], array[j]] = [array[j], array[i]];
    }
}

// クイズ開始時に選択肢をシャッフル
shuffle(question);

//並べ替えクイズの処理
function showQuestion() {
    //答えを格納している配列を初期化
    answers.length = 0; 
    for (let i = 0; i < 4; i++) {
        answer[i].textContent = i + 1;
    }

    //問題の解答シャッフル Fisher–Yatesアルゴリズムを用いる
    //値渡しコピーで配列に代入
    let shufflea = question[questionnum].a.concat(); 
    for (let i = shufflea.length - 1; i > 0; i--) {
        let r = Math.floor(Math.random() * (i + 1));
        let tmp = shufflea[i];
        shufflea[i] = shufflea[r];
        shufflea[r] = tmp;
    }

    //問題文挿入
    document.querySelector("h1").textContent = question[questionnum].q;
    //回答選択肢挿入
    for (let i = 0; i < shufflea.length; i++) {
        select[i].classList.remove('is-hidden');
        select[i].textContent = shufflea[i];
    }

    let count = 0;
    //選択された答えを消す 
    for (let i = 0; i < shufflea.length; i++) {
        select[i].onclick = () => {
            console.log(count);
            select[i].classList.add('is-hidden');
            //選択された答えを移動
            answer[count].textContent = select[i].textContent;
            answers.push(answer[count].textContent);
            count += 1;
            if (count == shufflea.length) {
                count = 0;
                Judgment();
            }
        }
    }
}

//正解かどうか判定
function Judgment() {
    changescene(scecegame, next);
    if (JSON.stringify(question[questionnum].a) == JSON.stringify(answers)) {
        next.innerHTML = "<p style='font-size:3em;color:#008000;'>バッチリ😄　です！</p><button onclick='nextquestion()'>次に　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　進みます！</button>";

    } else {
        next.innerHTML = "<p style='font-size:3em;color:#008080;'>オーケー😊　です！</p><button onclick='nextquestion()'>次に　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　　進みます！</button>";
    }
}

//次の問題ボタンが押された時の処理
function nextquestion() {
    questionnum++
    if (Object.keys(question).length > questionnum) {
        changescene(next, scecegame);
        showQuestion();
    } else {
        questionnum = 0;
        changescene(next, scecegame);
        showQuestion();
    }
}
